import { Prisma, PrismaClient } from "@prisma/client";

const prisma = new PrismaClient();

const settings = [
  {
    key: "general",
    value: {
      name: "Адвокатське об'єднання «Рівновага»",
      phone: "+380954299650",
      email: "rivnovaga.ao@gmail.com",
      telegram: "+380954299650",
      viber: "+380954299650",
      whatsapp: "+380954299650",
    },
  },
  {
    key: "logo",
    value: {
      url: "/assets/images/logo.png",
      fileName: "logo.png",
    },
  },
  {
    key: "address",
    value: {
      index: "08200",
      city: "м. Ірпінь",
      street: "вул. Джерельна",
      building: "14",
      office: "119",
    },
  },
  {
    key: "map",
    value: {
      lat: "50.520469750328935",
      lng: "30.20618508465575",
    },
  },
  {
    key: "workingDaysSchedule",
    value: {
      start: "monday",
      end: "friday",
    },
  },
  {
    key: "workingTimeSchedule",
    value: {
      start: "10:00",
      end: "18:00",
    },
  },
  {
    key: "hero",
    value: {
      title:
        "Професійна юридична підтримка у всіх сферах права. Захищаємо ваші інтереси ефективно та чесно",
      subtitle: "Ваш захист — наш пріоритет",
    },
  },
  {
    key: "cta",
    value: {
      title: "Потребуєте юридичної допомоги?",
      description:
        "<p>Зверніться до нас, щоб отримати кваліфіковану підтримку у вирішенні правових питань будь-якої складності. Ми надаємо професійні консультації, допомагаємо підготувати необхідні документи та забезпечуємо надійний захист ваших прав і інтересів у суді.</p><p>Наш досвід і відповідальний підхід гарантують ефективне вирішення справи у найкоротші терміни.</p><p>Не відкладайте захист своїх прав — зв’яжіться з нами вже сьогодні.</p>",
    },
  },
  {
    key: "about",
    value: [
      {
        title: "Адвокат Київ та область",
        description:
          "<p>Вас вітає адвокатське об'єднання «Рівновага». Ми группа досвідченних адвокатів, які допоможуть Вам у будь-якій справі. Ми маємо великий досвід роботи із судовою системою, правоохоронними органами та знаємо всі важливі нюанси. Наша робота не обмежується Києвом та областю – ми успішно представляємо інтереси клієнтів по всій Україні. Завдяки тісній співпраці с частними судовими виконавцями ми готові не тількі добитися судового рішення для вас але і забезпечити його виконання. Ми готові взятися за будь-яку складну справу та забезпечити найкращий результат для Вас. Ми цінуємо кожного клієнта та розуміємо, що кожна справа є унікальною. Тому ми надаємо індивідуальний підхід до кожної справи та працюємо з максимальною увагою до деталей. Ми дбаємо про довіру наших клієнтів та завжди дотримуємось високих етичних стандартів. Ми гарантуємо повну конфіденційність та дотримання адвокатської таємниці. Наша цінова політика індивідуальна та орієнтована на інтереси клієнта. Звертаючись до нас, Ви можете бути впевнені, що Ваші інтереси будуть захищені професійними адвокатами, робота яких вартує сплачених коштів.</p>",
      },
      {
        title: "Дистанційне представництво",
        description:
          "<p>Якщо Ви знаходитесь у будь-якому куточку України, на окупованій території або за кордоном, Ви можете віддалено укласти договір з нашими адвокатами та скористатися нашими послугами. Послуги будуть надані так само якісно та професійно як і при особистій зустрічі. Ви зможете слідкувати за ходом справи в режимі онлайн, брати участь в судових засіданнях через відео зв'язок та отримувати інформацію про свою справу через державну систему Електронний Суд. Ваша фізична присутність не обов'язкова – це може значно заощадити Ваш час та гроші.</p>",
      },
    ],
  },
  {
    key: "useful_links",
    value: [
      {
        title: "Сайти системи судоустрою",
        id: "8ed15ce1-cb97-4642-baef-4c367a1e20ee",
        isActive: true,
        data: [
          {
            label: "Судова влада України",
            link: "https://court.gov.ua/",
            id: "c5d9f1e3-f383-4a40-afb4-8ccc420c2fab",
          },
          {
            label: "Електронний суд",
            link: "https://cabinet.court.gov.ua/",
            id: "de949f3d-678a-4ee5-97cc-421d677be68e",
          },
          {
            label: "Сплата судового збору",
            link: "https://court.gov.ua/affairs/sudytax/",
            id: "fd4930ac-e033-4bab-83c4-8a21e3be9f90",
          },
          {
            label: "Участь в судовому засіданні онлайн",
            link: "https://vkz.court.gov.ua/",
            id: "308991ae-cdd8-44f8-90ba-02f5a28c6ebc",
          },
          {
            label: "Список судових справ, призначених до розгляду",
            link: "https://court.gov.ua/assignments/",
            id: "bb483a2b-5222-42fc-bf7a-a6295f734639",
          },
          {
            label: "Стан розгляду справ",
            link: "https://court.gov.ua/fair/",
            id: "66b6032b-46ac-4acc-85a1-88401be344d2",
          },
        ],
      },
      {
        title: "Правоохоронні органи",
        id: "ced0a061-4799-45b6-86ae-e34f581f353d",
        isActive: true,
        data: [
          {
            label: "Бюро економічної безпеки",
            link: "https://esbu.gov.ua/",
            id: "11ec4092-a49d-4791-98d6-1e1dbc0a835a",
          },
          {
            label: "Генеральна прокуратура України",
            link: "https://www.gp.gov.ua/",
            id: "2201cfd2-5643-4aa5-bfec-ca8a2f82f54f",
          },
          {
            label: "Державне бюро розслідувань",
            link: "https://dbr.gov.ua/",
            id: "ed3966d5-6ed7-40b2-bb63-5049b5f3c136",
          },
          {
            label: "Національна поліція",
            link: "https://www.npu.gov.ua/",
            id: "dde8b956-debd-4c17-9d21-361ff1ee2f5d",
          },
          {
            label: "Служба безпеки України",
            link: "https://ssu.gov.ua/",
            id: "6de3e198-836b-462b-9023-41d99d008bd3",
          },
        ],
      },
    ],
  },
  {
    key: "lawyers",
    value: [
      {
        id: "d34210a8-530b-4927-9845-638d768393b1",
        name: "Михайло",
        surname: "Тесленко",
        patronymic: "Сергійович",
        isActive: true,
        certificate: {
          number: "5270",
          date: "28.11.2018",
        },
        phone: "+380000000000",
        description:
          "<p>Надання повного спектра правової допомоги, який включає консультації та роз’яснення з правових питань, представництво інтересів фізичних і юридичних осіб у судах усіх юрисдикцій, державних органах та органах місцевого самоврядування. Підготовка позовних заяв, скарг, клопотань та інших процесуальних документів.</p><br/><p>Здійснення захисту прав, свобод і законних інтересів підозрюваних, обвинувачених, засуджених або виправданих осіб, а також осіб, щодо яких застосовуються примусові медичні чи виховні заходи. Надання юридичної допомоги свідкам у кримінальних провадженнях, представництво інтересів потерпілих у справах про адміністративні правопорушення, а також цивільних позивачів і відповідачів у кримінальних справах.</p><br/><p>Представництво інтересів клієнтів у цивільних, господарських, адміністративних та конституційних судах, у державних установах, а також у взаєминах з іншими фізичними та юридичними особами.</p>",
        photo: {
          url: "/assets/images/advokat.jpg",
          fileName: "advokat.jpg",
        },
      },
    ],
  },
  {
    key: "about_lawyers",
    value: {
      title: "Про адвокатiв",
      subtitle:
        "На цій сторінці представлена команда кваліфікованих адвокатів, які мають багаторічний досвід роботи та глибоке розуміння українського законодавства. Наші фахівці поєднують професійні знання з практичним досвідом участі у судових процесах, консультуванні клієнтів та вирішенні складних правових питань. Вони спеціалізуються у різних напрямах — від цивільного та сімейного права до господарських і кримінальних справ.",
    },
  },
  {
    key: "about_practice",
    value: {
      title: "Наша практика",
      subtitle:
        "На цій сторінці представлено приклади справ, у яких адвокати нашого об'єднання успішно захищали права та інтереси клієнтів. Ми ділимося рішеннями судів, що підтверджують нашу професійність, досвід і відданість справі. Кожна справа — це результат ретельної підготовки, глибокого аналізу законодавства та наполегливої роботи нашої команди. Ми пишаємося тим, що допомагаємо клієнтам досягати справедливості у найскладніших правових ситуаціях. Ознайомтесь із нашими справами нижче, щоб побачити реальні результати нашої роботи.",
    },
  },
  {
    key: "about_services",
    value: {
      title: "Нашi послуги",
      subtitle:
        "Наша адвокатська діяльність спрямована на професійний захист прав, свобод і законних інтересів клієнтів. Ми надаємо повний спектр правової допомоги — від консультацій до представництва в судах та органах державної влади.",
    },
  },
];

const services: Prisma.ServiceCreateInput[] = [
  {
    title:
      "Вирішення сімейних спорів - розірвання шлюбу, поділ майна, визначення місця проживання дитини",
    description:
      "<p>Вирішення сімейних спорів — це один із найчутливіших напрямів юридичної практики, адже йдеться не лише про правові питання, а й про особисті стосунки, емоції та долі людей. Наша мета — допомогти клієнтам пройти цей непростий етап життя максимально спокійно, зберігаючи гідність, інтереси та майнові права.</p><p>Ми надаємо повний спектр послуг у справах, що стосуються розірвання шлюбу, поділу майна подружжя, визначення місця проживання дитини, а також встановлення порядку участі у вихованні. Наші юристи ретельно аналізують кожну ситуацію, допомагають зібрати докази, підготувати процесуальні документи та представляють ваші інтереси в суді.</p><p>Особливу увагу ми приділяємо спорам, що стосуються дітей, адже вони потребують не лише правової, а й моральної чутливості. Ми допоможемо досягти рішення, яке забезпечить найкращі умови для дитини, водночас захищаючи права кожного з батьків.</p><p>У справах про поділ спільного майна ми допомагаємо визначити частки, оскаржити неправомірні дії, довести факт спільного набуття чи навпаки — довести, що майно є особистою власністю. Також ми супроводжуємо мирні угоди між подружжям, які дозволяють уникнути судових конфліктів.</p><p>Кожна справа для нас — індивідуальна. Ми дбаємо про конфіденційність, уважно ставимося до деталей і завжди шукаємо рішення, яке буде найбільш вигідним і справедливим саме для вас. Наша команда допоможе вам пройти всі етапи процесу — від консультації та досудового врегулювання до отримання рішення суду й його виконання.</p><p>Ми переконані, що навіть найскладніші сімейні конфлікти можна вирішити цивілізовано. Звертаючись до нас, ви отримаєте не лише правову допомогу, а й підтримку професіоналів, які щиро зацікавлені у вашому спокої та добробуті.</p>",
    isActive: true,
    cover: {
      create: {
        url: "/assets/images/family.png",
        fileName: "family.png",
      },
    },
  },
];

async function main() {
  await prisma.user.create({
    data: {
      email: "test@test",
      password: "qwerty123",
    } as Prisma.UserCreateInput,
  });

  await prisma.$transaction(
    services.map((data) => prisma.service.create({ data }))
  );

  for (const setting of settings) {
    await prisma.setting.create({
      data: {
        key: setting.key,
        value: setting.value,
      } as Prisma.SettingCreateInput,
    });
  }
}

main()
  .catch((e) => console.error(e))
  .finally(async () => await prisma.$disconnect());
