import { Prisma, PrismaClient } from "@prisma/client";

const prisma = new PrismaClient();

const settings = [
  {
    key: "general",
    value: {
      name: "Адвокатське об'єднання «Рівновага»",
      phone: "+380954299650",
      email: "rivnovaga.ao@gmail.com",
      telegram: "+380954299650",
      viber: "+380954299650",
      whatsapp: "+380954299650",
    },
  },
  {
    key: "logo",
    value: {
      url: "assets/images/logo.png",
      fileName: "logo.png",
    },
  },
  {
    key: "address",
    value: {
      index: "08200",
      city: "м. Ірпінь",
      street: "вул. Джерельна",
      building: "14",
      office: "119",
    },
  },
  {
    key: "map",
    value: {
      lat: "50.520469750328935",
      lng: "30.20618508465575",
    },
  },
  {
    key: "workingDaysSchedule",
    value: {
      start: "monday",
      end: "friday",
    },
  },
  {
    key: "workingTimeSchedule",
    value: {
      start: "10:00",
      end: "18:00",
    },
  },
  {
    key: "hero",
    value: {
      title:
        "Професійна юридична підтримка у всіх сферах права. Захищаємо ваші інтереси ефективно та чесно",
      subtitle: "Ваш захист — наш пріоритет",
    },
  },
  {
    key: "cta",
    value: {
      title: "Потребуєте юридичної допомоги?",
      description:
        "<p>Зверніться до нас, щоб отримати кваліфіковану підтримку у вирішенні правових питань будь-якої складності. Ми надаємо професійні консультації, допомагаємо підготувати необхідні документи та забезпечуємо надійний захист ваших прав і інтересів у суді.</p><p>Наш досвід і відповідальний підхід гарантують ефективне вирішення справи у найкоротші терміни.</p><p>Не відкладайте захист своїх прав — зв’яжіться з нами вже сьогодні.</p>",
    },
  },
  {
    key: "about",
    value: [
      {
        title: "Адвокат Київ та область",
        description:
          "<p>Вас вітає адвокатське об'єднання «Рівновага». Ми группа досвідченних адвокатів, які допоможуть Вам у будь-якій справі. Ми маємо великий досвід роботи із судовою системою, правоохоронними органами та знаємо всі важливі нюанси. Наша робота не обмежується Києвом та областю – ми успішно представляємо інтереси клієнтів по всій Україні. Завдяки тісній співпраці с частними судовими виконавцями ми готові не тількі добитися судового рішення для вас але і забезпечити його виконання. Ми готові взятися за будь-яку складну справу та забезпечити найкращий результат для Вас. Ми цінуємо кожного клієнта та розуміємо, що кожна справа є унікальною. Тому ми надаємо індивідуальний підхід до кожної справи та працюємо з максимальною увагою до деталей. Ми дбаємо про довіру наших клієнтів та завжди дотримуємось високих етичних стандартів. Ми гарантуємо повну конфіденційність та дотримання адвокатської таємниці. Наша цінова політика індивідуальна та орієнтована на інтереси клієнта. Звертаючись до нас, Ви можете бути впевнені, що Ваші інтереси будуть захищені професійними адвокатами, робота яких вартує сплачених коштів.</p>",
      },
      {
        title: "Дистанційне представництво",
        description:
          "<p>Якщо Ви знаходитесь у будь-якому куточку України, на окупованій території або за кордоном, Ви можете віддалено укласти договір з нашими адвокатами та скористатися нашими послугами. Послуги будуть надані так само якісно та професійно як і при особистій зустрічі. Ви зможете слідкувати за ходом справи в режимі онлайн, брати участь в судових засіданнях через відео зв'язок та отримувати інформацію про свою справу через державну систему Електронний Суд. Ваша фізична присутність не обов'язкова – це може значно заощадити Ваш час та гроші.</p>",
      },
    ],
  },
];

async function main() {
  await prisma.user.create({
    data: {
      email: "test@test",
      password: "qwerty123",
    } as Prisma.UserCreateInput,
  });

  for (const setting of settings) {
    await prisma.setting.create({
      data: {
        key: setting.key,
        value: JSON.stringify(setting.value),
      } as Prisma.SettingCreateInput,
    });
  }
}

main()
  .catch((e) => console.error(e))
  .finally(async () => await prisma.$disconnect());
