import { Prisma, PrismaClient } from "@prisma/client";
import bcrypt from "bcrypt";

const prisma = new PrismaClient();

const settings = [
  {
    key: "general",
    value: {
      name: "Адвокатське об'єднання «Рівновага»",
      phone: "+380954299650",
      email: "rivnovaga.ao@gmail.com",
      telegram: "+380954299650",
      viber: "+380954299650",
      whatsapp: "+380954299650",
    },
  },
  {
    key: "logo",
    value: {
      url: "/assets/images/logo.png",
      fileName: "logo.png",
    },
  },
  {
    key: "address",
    value: {
      index: "08200",
      city: "м. Ірпінь",
      street: "вул. Джерельна",
      building: "14",
      office: "119",
    },
  },
  {
    key: "map",
    value: {
      lat: "50.520469750328935",
      lng: "30.20618508465575",
    },
  },
  {
    key: "workingDaysSchedule",
    value: {
      start: "monday",
      end: "friday",
    },
  },
  {
    key: "workingTimeSchedule",
    value: {
      start: "10:00",
      end: "18:00",
    },
  },
  {
    key: "hero",
    value: {
      title:
        "Професійна юридична підтримка у всіх сферах права. Захищаємо ваші інтереси ефективно та чесно",
      subtitle: "Ваш захист — наш пріоритет",
    },
  },
  {
    key: "cta",
    value: {
      title: "Потребуєте юридичної допомоги?",
      description:
        "<p>Зверніться до нас, щоб отримати кваліфіковану підтримку у вирішенні правових питань будь-якої складності. Ми надаємо професійні консультації, допомагаємо підготувати необхідні документи та забезпечуємо надійний захист ваших прав і інтересів у суді.</p><p>Наш досвід і відповідальний підхід гарантують ефективне вирішення справи у найкоротші терміни.</p><p>Не відкладайте захист своїх прав — зв’яжіться з нами вже сьогодні.</p>",
    },
  },
  {
    key: "about",
    value: [
      {
        title: "Адвокат Київ та область",
        description:
          "<p>Вас вітає адвокатське об'єднання «Рівновага». Ми группа досвідченних адвокатів, які допоможуть Вам у будь-якій справі. Ми маємо великий досвід роботи із судовою системою, правоохоронними органами та знаємо всі важливі нюанси. Наша робота не обмежується Києвом та областю – ми успішно представляємо інтереси клієнтів по всій Україні. Завдяки тісній співпраці с частними судовими виконавцями ми готові не тількі добитися судового рішення для вас але і забезпечити його виконання. Ми готові взятися за будь-яку складну справу та забезпечити найкращий результат для Вас. Ми цінуємо кожного клієнта та розуміємо, що кожна справа є унікальною. Тому ми надаємо індивідуальний підхід до кожної справи та працюємо з максимальною увагою до деталей. Ми дбаємо про довіру наших клієнтів та завжди дотримуємось високих етичних стандартів. Ми гарантуємо повну конфіденційність та дотримання адвокатської таємниці. Наша цінова політика індивідуальна та орієнтована на інтереси клієнта. Звертаючись до нас, Ви можете бути впевнені, що Ваші інтереси будуть захищені професійними адвокатами, робота яких вартує сплачених коштів.</p>",
      },
      {
        title: "Дистанційне представництво",
        description:
          "<p>Якщо Ви знаходитесь у будь-якому куточку України, на окупованій території або за кордоном, Ви можете віддалено укласти договір з нашими адвокатами та скористатися нашими послугами. Послуги будуть надані так само якісно та професійно як і при особистій зустрічі. Ви зможете слідкувати за ходом справи в режимі онлайн, брати участь в судових засіданнях через відео зв'язок та отримувати інформацію про свою справу через державну систему Електронний Суд. Ваша фізична присутність не обов'язкова – це може значно заощадити Ваш час та гроші.</p>",
      },
    ],
  },
  {
    key: "useful_links",
    value: [
      {
        title: "Сайти системи судоустрою",
        id: "8ed15ce1-cb97-4642-baef-4c367a1e20ee",
        isActive: true,
        data: [
          {
            label: "Судова влада України",
            link: "https://court.gov.ua/",
            id: "c5d9f1e3-f383-4a40-afb4-8ccc420c2fab",
          },
          {
            label: "Електронний суд",
            link: "https://cabinet.court.gov.ua/",
            id: "de949f3d-678a-4ee5-97cc-421d677be68e",
          },
          {
            label: "Сплата судового збору",
            link: "https://court.gov.ua/affairs/sudytax/",
            id: "fd4930ac-e033-4bab-83c4-8a21e3be9f90",
          },
          {
            label: "Участь в судовому засіданні онлайн",
            link: "https://vkz.court.gov.ua/",
            id: "308991ae-cdd8-44f8-90ba-02f5a28c6ebc",
          },
          {
            label: "Список судових справ, призначених до розгляду",
            link: "https://court.gov.ua/assignments/",
            id: "bb483a2b-5222-42fc-bf7a-a6295f734639",
          },
          {
            label: "Стан розгляду справ",
            link: "https://court.gov.ua/fair/",
            id: "66b6032b-46ac-4acc-85a1-88401be344d2",
          },
        ],
      },
      {
        title: "Правоохоронні органи",
        id: "ced0a061-4799-45b6-86ae-e34f581f353d",
        isActive: true,
        data: [
          {
            label: "Бюро економічної безпеки",
            link: "https://esbu.gov.ua/",
            id: "11ec4092-a49d-4791-98d6-1e1dbc0a835a",
          },
          {
            label: "Генеральна прокуратура України",
            link: "https://www.gp.gov.ua/",
            id: "2201cfd2-5643-4aa5-bfec-ca8a2f82f54f",
          },
          {
            label: "Державне бюро розслідувань",
            link: "https://dbr.gov.ua/",
            id: "ed3966d5-6ed7-40b2-bb63-5049b5f3c136",
          },
          {
            label: "Національна поліція",
            link: "https://www.npu.gov.ua/",
            id: "dde8b956-debd-4c17-9d21-361ff1ee2f5d",
          },
          {
            label: "Служба безпеки України",
            link: "https://ssu.gov.ua/",
            id: "6de3e198-836b-462b-9023-41d99d008bd3",
          },
        ],
      },
    ],
  },
  {
    key: "about_lawyers",
    value: {
      title: "Про адвокатiв",
      subtitle:
        "На цій сторінці представлена команда кваліфікованих адвокатів, які мають багаторічний досвід роботи та глибоке розуміння українського законодавства. Наші фахівці поєднують професійні знання з практичним досвідом участі у судових процесах, консультуванні клієнтів та вирішенні складних правових питань. Вони спеціалізуються у різних напрямах — від цивільного та сімейного права до господарських і кримінальних справ.",
    },
  },
  {
    key: "about_practice",
    value: {
      title: "Наша практика",
      subtitle:
        "На цій сторінці представлено приклади справ, у яких адвокати нашого об'єднання успішно захищали права та інтереси клієнтів. Ми ділимося рішеннями судів, що підтверджують нашу професійність, досвід і відданість справі. Кожна справа — це результат ретельної підготовки, глибокого аналізу законодавства та наполегливої роботи нашої команди. Ми пишаємося тим, що допомагаємо клієнтам досягати справедливості у найскладніших правових ситуаціях. Ознайомтесь із нашими справами нижче, щоб побачити реальні результати нашої роботи.",
    },
  },
  {
    key: "useful_materials",
    value: {
      title: "Кориснi матерiали",
      subtitle:
        "На цій сторінці зібрано добірку корисних матеріалів для ознайомлення та практичного використання. Тут ви знайдете зразки основних процесуальних документів, типових заяв, договорів та інших юридичних форм, які допоможуть у підготовці до звернення до суду чи інших органів. Також представлено добірку чинних нормативно-правових актів, що регулюють ключові правові питання у різних галузях. Матеріали покликані надати зручний доступ до перевіреної правової інформації та сприяти підвищенню обізнаності громадян у сфері права.",
    },
  },
  {
    key: "regulatory_acts",
    value: [
      {
        id: "3ac38fce-5d4c-4e15-90f0-285c3c133860",
        title: "Європейська конвенція з прав людини",
        link: "https://www.echr.coe.int/documents/d/echr/convention_ukr",
      },
      {
        id: "4a77230e-078f-4116-a2b4-65a56ef72efe",
        title: "Кодекс України про адміністративні правопорушення",
        link: "https://zakon.rada.gov.ua/laws/show/80731-10/stru#Stru",
      },
      {
        id: "739d0ed9-f8e8-4d8a-b966-61e64ddc0c59",
        title: "Конституція України",
        link: "https://zakon.rada.gov.ua/laws/show/254%D0%BA/96-%D0%B2%D1%80/stru#Stru",
      },
    ],
  },
  {
    key: "about_services",
    value: {
      title: "Нашi послуги",
      subtitle:
        "Наша адвокатська діяльність спрямована на професійний захист прав, свобод і законних інтересів клієнтів. Ми надаємо повний спектр правової допомоги — від консультацій до представництва в судах та органах державної влади.",
    },
  },
];

async function main() {
  await prisma.user.create({
    data: {
      email: process.env.ADMIN_EMAIL!,
      password: await bcrypt.hash(process.env.ADMIN_TEMP_PASSWORD!, 12),
    } as Prisma.UserCreateInput,
  });

  for (const setting of settings) {
    await prisma.setting.create({
      data: {
        key: setting.key,
        value: setting.value,
      } as Prisma.SettingCreateInput,
    });
  }
}

main()
  .catch((e) => console.error(e))
  .finally(async () => await prisma.$disconnect());
