import Container from "../../ui/Container";
import MainSection from "../../ui/MainSection";

export default function AboutSection() {
  return (
    <MainSection className="scroll-mt-[110px]" id="about">
      <Container className="flex flex-col gap-10">
        <div className="flex gap-15">
          <div className="flex flex-col gap-10 w-2/4">
            <h2 className="text-primary-dark w-fit">Адвокат Київ та область</h2>

            <p className="text-primary-lighter">
              Вас вітає адвокатське об&apos;єднання «Рівновага». Ми группа
              досвідченних адвокатів, які допоможуть Вам у будь-якій справі. Ми
              маємо великий досвід роботи із судовою системою, правоохоронними
              органами та знаємо всі важливі нюанси. Наша робота не обмежується
              Києвом та областю – ми успішно представляємо інтереси клієнтів по
              всій Україні. Завдяки тісній співпраці с частними судовими
              виконавцями ми готові не тількі добитися судового рішення для вас
              але і забезпечити його виконання. Ми готові взятися за будь-яку
              складну справу та забезпечити найкращий результат для Вас. Ми
              цінуємо кожного клієнта та розуміємо, що кожна справа є
              унікальною. Тому ми надаємо індивідуальний підхід до кожної справи
              та працюємо з максимальною увагою до деталей. Ми дбаємо про довіру
              наших клієнтів та завжди дотримуємось високих етичних стандартів.
              Ми гарантуємо повну конфіденційність та дотримання адвокатської
              таємниці. Наша цінова політика індивідуальна та орієнтована на
              інтереси клієнта. Звертаючись до нас, Ви можете бути впевнені, що
              Ваші інтереси будуть захищені професійними адвокатами, робота яких
              вартує сплачених коштів.
            </p>
          </div>

          <div className="flex flex-col gap-10 w-2/4">
            <h2 className="text-primary-dark w-fit">
              Дистанційне представництво
            </h2>

            <p className="text-primary-lighter">
              Якщо Ви знаходитесь у будь-якому куточку України, на окупованій
              території або за кордоном, Ви можете віддалено укласти договір з
              нашими адвокатами та скористатися нашими послугами. Послуги будуть
              надані так само якісно та професійно як і при особистій зустрічі.
              Ви зможете слідкувати за ходом справи в режимі онлайн, брати
              участь в судових засіданнях через відео зв&apos;язок та отримувати
              інформацію про свою справу через державну систему Електронний Суд.
              Ваша фізична присутність не обов&apos;язкова – це може значно
              заощадити Ваш час та гроші.
            </p>
          </div>
        </div>
      </Container>
    </MainSection>
  );
}
